#!/usr/bin/env python
# -*- coding: utf-8 -*-

__mtime__ = '2020-03-01'

"""
一、JSON/表单格式实战

【第1题】、分别用JSON和表单格式：表示小桃的个人基本信息1，person1=?姓名：小桃，性别：女，年龄：25，身高：1.64婚否：是，收入：

【第2题】、分别用JSON和表单格式：表示小开的个人基本信息2，person2=?姓名：小开，性别：男，年龄：26，身高：1.75，婚否：否，收入：500

【第3题】、用JSON：同时表示小桃和小开的基本信息，array=?

【第4题】、用JSON和表单格式：表示几本书  books=?大学英语,高等数学,线性代数,计算机网络,汇编语言

【第5题】、用JSON：表示小开的基本信息和他的几本书,object=?

【第6题】、用JSON：表示小开的基本信息和他的2个孩子的信息,object=?
姓名  	  性别	  年龄
小小开	   男	    5
小小关	   女       3

"""



"""
# 1.
{
    "姓名": "小桃",
    "性别": "女",
    "年龄": 25,
    "身高": 1.64,
    "婚姻": true,
    "收入": null
}
person1=?姓名=小桃&性别=女&年龄=25&身高=1.64&婚否=true&收入=

# 2.
{
    "姓名": "小开", 
    "性别": "男", 
    "年龄": 26, 
    "身高": 1.75, 
    "婚否": false, 
    "收入": 500
}
person2=?姓名=小开&性别=男&年龄=26&身高=1.75&婚否=false&收入=500

#3
[
{
    "姓名": "小桃",
    "性别": "女",
    "年龄": 25,
    "身高": 1.64,
    "婚姻": true,
    "收入": null
},
{
    "姓名": "小开", 
    "性别": "男", 
    "年龄": 26, 
    "身高": 1.75, 
    "婚否": false, 
    "收入": 500
}
]

#4.
[
    "大学英语", 
    "高等数学", 
    "线性代数", 
    "计算机网络", 
    "汇编语言"
]

books=?大学英语&高等数学&线性代数&计算机网络&汇编语言


#5.
{
    "姓名": "小开", 
    "性别": "男", 
    "年龄": 26, 
    "身高": 1.75, 
    "婚否": false, 
    "收入": 500, 
    "books": [
        "大学英语", 
        "高等数学", 
        "线性代数", 
        "计算机网络", 
        "汇编语言"
    ]
}

#6.

{
    "姓名": "小开", 
    "性别": "男", 
    "年龄": 26, 
    "身高": 1.75, 
    "婚否": false, 
    "收入": 500, 
    "sons": [
        {
            "姓名": "小小开", 
            "性别": "男", 
            "年龄": 5
        }, 
        {
            "姓名": "小小开", 
            "性别": "女", 
            "年龄": 3
        }
    ]
}

"""
